#include "tm1629d.h"


//************************************************************************
// 函数名称：Tm1629DSentData
// 函数功能：向TM1620发数据 8位数据-1个字节的数据
// 入口参数：要操作的数据
// 出口参数：无
// 技术简要：上升沿操作一位 从低位开始操作数据
//***************************************************************************/
void Tm1629DSentData(uint8_t oneByte)
{
	uint8_t i;  
   
	
  for(i=0;i<8;i++)   
  {   
    
		 TM1629D_SCL = 0;//CLK_TM1620_CLR; 
		//  _nop_(); 
		 if(oneByte & (1 << i))  
		 {
	       TM1629D_SDA  = 1;//DIO_TM1620_SET;
	       // _nop_(); 
			// _nop_(); 
	      }   
		 else 
		 {
	          TM1629D_SDA =0;//DIO_TM1620_CLR;
	        //   _nop_(); 
			//   _nop_(); 
       
         }   
	     //  _nop_(); 
		//  _nop_(); 
		 TM1629D_SCL = 1;//CLK_TM1620_SET; //上升沿操作      
      }   
 
}






